import React, { useState } from 'react';
import './UserTips.css';
import { FiChevronDown } from 'react-icons/fi';

// Дані для порад
const tipsData = [
  {
    question: 'Який стиль листівки обрати?',
    answer: 'Прості стилі типу мультяшний та його варіації, а також такі стилі як акварель, line-art, піксель  забезпечують високу точність відтворення зовнішності за умови підходящого фото отримувача привітання та гарно додають в композицію обрані доповнення або фон. Потрібно враховувати що зовнішність отримувача часто може адаптуватися до стилю. Наприклад стиль аніме точно намагатиметься відтворити зовнішність з урахуванням характерних рис притаманних стилю. Стиль масляної картини може надихнутися рисами зовнішності персонажів картин відповідної епохи, а мультяшний гламур може відтворити більш надуті губки жіночому персонажу. Відповідно і наші більш контекстні стилі такі як афіша бойовика, комедійний або детективний постер можуть додати вашому імениннику більш накачані руки, пафосний погляд голлівудського героя чи посмішку комедійного актора. Будьте готові до таких інтерпретацій вашої знайомої людини та нестримний сміх і захоплення подарують радість не тільки імениннику, а і Вам.'
  },
  {
    question: 'Які доповнення або фон додати до композиції листівки?',
    answer: 'Головне, щоб доповнення або фон відповідали якостям, інтересам чи стилю життя отримувача привітання та ще краще якщо це буде щось що доповнить обраний стиль чи фото. Також важливим критерієм є простота формулювання у вигляді достатньо стислого речення чи словосполучення із зазначенням конкретних речей, чи місць. Обирайте із запропонованих нами доповнень або напишіть свій варіант у полі чітко беручи за основу один із наших.'
  },
  {
    question: 'Яке фото отримувача привітання найкраще підійде?',
    answer: 'Найкраще підходять фотографії з гарним освітленням де добре видно обличчя яке розміщення ближче до центру зображення. Якщо є якісь об’єкти з якими взаємодіє людина на фото то це може бути відображено на листівці. В такому разі можна експериментувати зі стилями і підбирати той до контексту якого підійде обєкт. Наприклад якщо маєте фото де ваш друг сидить за кермом багі то цей сюжет може бути розвинутий такими стилями як комікс або афіша бойовика, а доповнення фону у вигляді хмарочосів Києва створить цілісну композицію всесвіту в якому ваш друг - супергерой. Також як експерименти можна використовувати фото де дві людини, але не більше. Якщо це, наприклад пара або двоє друзів які зображені в центрі якісного фото то їх зовнішність буде достатньо точно відображена на листівці з використанням простих стилів таких як мультяшний або акварель.'
  },
  {
    question: 'Як легко створити цілісну композицію листівки? ',
    answer: 'Для того щоб створити цілісну композицію зображення вашої листівки потрібно зібрати чітку комбінацію зі стиля, фотографії отримувача привітання та доповнень або фону. Стиль має добре підходити до фото яке ви завантажите, має доповнювати образ, дію людини з фото та об’єкти з якими вона взаємодіє. Та дуже важливою і яскравою вишенькою на торті буде доповнення або фон які логічно впишуться до обраного вище, відповідатимуть інтересам чи мріям отримувача привітання та створять сюжет зображення листівки.'
  },
  {
    question: 'Як на листівці якісно відтворити зовнішність отримувача привітання?',
    answer: 'На якісне відтворення зовнішності людини найбільше впливає саме фото яке обране для створення листівки. Важливо щоб обличчя було чітко видно під гарним освітленням ближче до центру та якість самого зображення має бути достатня. Наступним чинником є обраний вами стиль і тут грають роль два аспекти: чим простіший стиль, тим простіше привітайку відтворити зовнішність, та наступний момент стосується стандартів пов’язаних зі стилем (наприклад аніме, середньовічні картини, та навіть мультяшність має певні особливості рис зовнішності персонажів що матиме свій вплив).'
  },
  {
    question: 'Як згенерувати ідеї тексту привітання?',
    answer: 'Тисніть кнопку "згенерувати ідеї тексту привітання" на головній сторінці або "Додати текст привітання" під готовою листівкою після її створення,  додавайте інформацію із запропонованих або власних варіантів на основі якої ви бажаєте створити привітання. Ідеї текстів будуть запропоновані в п’яти варіантах, ви можете обрати той який найбільше сподобався та підредагувати на свій манір або залишити без змін. Готовий текст можна відправити повідомленням або додати до зображення листівки.'
  },
  {
    question: 'Які події додавати до календаря привітань?',
    answer: 'В першу чергу рекомендуємо додавати дні народження, в пріоритеті ті які найближче та ті про які інколи забуваєте. До кожної події ви отримаєте п’ять автоматичних нагадувань, заздалегідь та вдень свята, це допоможе вам бути готовими та пам’ятати. Окремий сервіс зосереджений саме на привітаннях допоможе відокремити нагадування про такі дати від решти ваших планів та уникнути ризику коли сповіщення губляться серед задач в планувальниках. Ви можете додавати необмежену кількість подій до календаря та за перші 30 будете отримувати бонуси. Наступні події які варто запланувати в нашому сервісі - це річниці, як особисті, так і корпоративні, наприклад щоб привітати співробітника з річницею долучення до команди та відзначити його результати та цілі у вигляді листівки. Також ви зможете увімкнути в календарі професійні свята та додати до відповідних дат знайомих які мають до них відношення. До інших календарних свят таких як, наприклад Новий рік додайте список знайомих яких важливо не забути привітати з таким святом.'
  }
];

const UserTips = () => {
  const [activeIndex, setActiveIndex] = useState(null);

  const toggleAccordion = (index) => {
    setActiveIndex(activeIndex === index ? null : index);
  };

  return (
    <section className="tips-section">
      <div className="tips-title-container">
        <h2 className="tips-title">Поради користувачам</h2>
        <p className="tips-subtitle">для отримання кращих результатів</p>
      </div>
      <div className="accordion-container">
        {tipsData.map((item, index) => (
          <div key={index} className="accordion-item">
            <button className="accordion-question" onClick={() => toggleAccordion(index)}>
              <span>{item.question}</span>
              <FiChevronDown className={`accordion-icon ${activeIndex === index ? 'active' : ''}`} />
            </button>
            <div className={`accordion-answer ${activeIndex === index ? 'active' : ''}`}>
              <p>{item.answer}</p>
            </div>
          </div>
        ))}
      </div>
    </section>
  );
};

export default UserTips;